webservice-camel/mtp/exampleCamelCXF/target/test-classes/contract.wsdl

<wsdl:definitions name="CustomersServiceService"
	targetNamespace="http://customer.service.esb.tecplata.com/" xmlns:xsd="http://www.w3.org/2001/XMLSchema"
	xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:tns="http://customer.service.esb.tecplata.com/"
	xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:ns1="http://schemas.xmlsoap.org/soap/http">
	<wsdl:types>
		<xs:schema attributeFormDefault="unqualified"
			elementFormDefault="unqualified" targetNamespace="http://customer.service.esb.tecplata.com/"
			xmlns:xs="http://www.w3.org/2001/XMLSchema">
			<xs:complexType name="customer">
				<xs:sequence>
					<xs:element minOccurs="0" name="address_1" type="xs:string" />
					<xs:element minOccurs="0" name="address_2" type="xs:string" />
					<xs:element minOccurs="0" name="address_3" type="xs:string" />
					<xs:element minOccurs="0" name="city" type="xs:string" />
					<xs:element minOccurs="0" name="contactName" type="xs:string" />
					<xs:element minOccurs="0" name="country" type="xs:string" />
					<xs:element minOccurs="0" name="creditLimit" type="xs:long" />
					<xs:element minOccurs="0" name="cuit" type="xs:string" />
					<xs:element minOccurs="0" name="email" type="xs:string" />
					<xs:element minOccurs="0" name="fax" type="xs:string" />
					<xs:element minOccurs="0" name="name" type="xs:string" />
					<xs:element minOccurs="0" name="phone" type="xs:string" />
					<xs:element minOccurs="0" name="stateName" type="xs:string" />
					<xs:element minOccurs="0" name="taxGroup" type="tns:taxgroup" />
				</xs:sequence>
			</xs:complexType>
			<xs:complexType name="taxgroup">
				<xs:sequence>
					<xs:element minOccurs="0" name="description" type="xs:string" />
					<xs:element minOccurs="0" name="id" type="xs:string" />
				</xs:sequence>
			</xs:complexType>
			<xs:element name="ServiceException" type="tns:ServiceException" />
			<xs:complexType name="ServiceException">
				<xs:sequence />
			</xs:complexType>
			<xs:element name="filter" type="tns:filter" />
			<xs:complexType name="filter">
				<xs:sequence>
					<xs:element minOccurs="0" name="cuit" type="xs:string" />
				</xs:sequence>
			</xs:complexType>
			<xs:element name="getCustomerByCuitResponse" type="tns:getCustomerByCuitResponse" />
			<xs:complexType name="getCustomerByCuitResponse">
				<xs:sequence>
					<xs:element minOccurs="0" name="customer" type="tns:customer" />
				</xs:sequence>
			</xs:complexType>
		</xs:schema>
	</wsdl:types>
	<wsdl:message name="getCustomerByCuitResponse">
		<wsdl:part element="tns:getCustomerByCuitResponse" name="parameters" />
	</wsdl:message>
	<wsdl:message name="getCustomerByCuit">
		<wsdl:part element="tns:filter" name="parameters" />
	</wsdl:message>
	<wsdl:message name="ServiceException">
		<wsdl:part element="tns:ServiceException" name="ServiceException" />
	</wsdl:message>
	<wsdl:portType name="CustomersService">
		<wsdl:operation name="getCustomerByCuit">
			<wsdl:input message="tns:getCustomerByCuit" name="getCustomerByCuit" />
			<wsdl:output message="tns:getCustomerByCuitResponse"
				name="getCustomerByCuitResponse" />
			<wsdl:fault message="tns:ServiceException" name="ServiceException" />
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="CustomersServiceServiceSoapBinding"
		type="tns:CustomersService">
		<soap:binding style="document"
			transport="http://schemas.xmlsoap.org/soap/http" />
		<wsdl:operation name="getCustomerByCuit">
			<soap:operation soapAction="" style="document" />
			<wsdl:input name="getCustomerByCuit">
				<soap:body use="literal" />
			</wsdl:input>
			<wsdl:output name="getCustomerByCuitResponse">
				<soap:body use="literal" />
			</wsdl:output>
			<wsdl:fault name="ServiceException">
				<soap:fault name="ServiceException" use="literal" />
			</wsdl:fault>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="CustomersServiceService">
		<wsdl:port binding="tns:CustomersServiceServiceSoapBinding"
			name="CustomersServicePort">
			<soap:address location="http://localhost:8181/cxf/CustomersService" />
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>