webservice-camel/mtp/exampleCamelCXF/target/test-classes/in.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
	xmlns:cus="http://customer.service.esb.tecplata.com/">
	<soapenv:Header />
	<soapenv:Body>
		<cus:filter xmlns:cus="http://customer.service.esb.tecplata.com/">
			<cuit>1</cuit>
		</cus:filter>
	</soapenv:Body>
</soapenv:Envelope> 